package interfaces;
//Добавить файл с описанием интерфейса. В котором описать два метода, void step(); и String getInfo();
//Реализовать интерфейс в абстрактном классе и в наследниках так, чтобы getInfo возвращал тип персонажа.
//        Создать два списка в классе main.
//        В каждый из списков добавить по десять случайных экземнляров наследников BaseHero.
//        Удалить ненужные методы из абстрактного класса, если такие есть.
//        В main пройти по спискам и вызвать у всех персонажей getInfo.
public interface NewInterface {
    void step();
    String getInfo();
}
